Revit 2026 API

# ParameterTypeIdEnergyAnalysisOutdoorAirInformationParam Property

---

"Outdoor Air Information"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId EnergyAnalysisOutdoorAirInformationParam { get; }
```
```vb
Public Shared ReadOnly Property EnergyAnalysisOutdoorAirInformationParam As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ EnergyAnalysisOutdoorAirInformationParam {
	ForgeTypeId^ get ();
}
```
```fsharp
static member EnergyAnalysisOutdoorAirInformationParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace